Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM6408JH00064.svd
            <register>
               <name>MRCR</name>
               <description>Master Remap Control</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB0Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB1Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB2Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB3Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB4Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB5Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB6</name>
                     <description>Remap Command Bit for Master 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB6Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB7</name>
                     <description>Remap Command Bit for Master 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB7Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB8</name>
                     <description>Remap Command Bit for Master 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB8Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB9</name>
                     <description>Remap Command Bit for Master 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB9Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB10</name>
                     <description>Remap Command Bit for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB10Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB11</name>
                     <description>Remap Command Bit for Master 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB11Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB12</name>
                     <description>Remap Command Bit for Master 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB12Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB13</name>
                     <description>Remap Command Bit for Master 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB13Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB14</name>
                     <description>Remap Command Bit for Master 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB14Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB15</name>
                     <description>Remap Command Bit for Master 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RCB15Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>SFR[%s]</name>
               <description>Special Function</description>
               <addressOffset>0x110</addressOffset>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
