Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM6408JH00064.svd
               <register>
                  <name>STATUS</name>
                  <description>USART_INT Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>PERR</name>
                        <description>Parity Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FERR</name>
                        <description>Frame Error</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTS</name>
                        <description>Clear To Send</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ISF</name>
                        <description>Inconsistent Sync Field</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COLL</name>
                        <description>Collision Detected</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXE</name>
                        <description>Transmitter Empty</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>USART_INT Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART_INT Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>USART_INT Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x42000800</baseAddress>
         <interrupt>
            <name>SERCOM1</name>
            <description>Serial Communication Interface 1</description>
            <value>10</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x42000C00</baseAddress>
         <interrupt>
            <name>SERCOM2</name>
            <description>Serial Communication Interface 2</description>
            <value>11</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x42001000</baseAddress>
         <interrupt>
            <name>SERCOM3</name>
            <description>Serial Communication Interface 3</description>
            <value>12</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>U21172.1.1</version>
         <description>Supply Controller</description>
         <baseAddress>0x40001800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSTEM</name>
            <description>System peripherals shared interrupt</description>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>BODVDDRDY</name>
                     <description>BODVDD Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODVDDDET</name>
                     <description>BODVDD Detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BVDDSRDY</name>
                     <description>BODVDD Synchronization Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCORERDY</name>
                     <description>BODCORE Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCOREDET</name>
                     <description>BODCORE Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCORESRDY</name>
                     <description>BODCORE Synchronization Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>BODVDDRDY</name>
                     <description>BODVDD Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODVDDDET</name>
                     <description>BODVDD Detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BVDDSRDY</name>
                     <description>BODVDD Synchronization Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCORERDY</name>
                     <description>BODCORE Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCOREDET</name>
                     <description>BODCORE Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCORESRDY</name>
                     <description>BODCORE Synchronization Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>BODVDDRDY</name>
                     <description>BODVDD Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODVDDDET</name>
                     <description>BODVDD Detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BVDDSRDY</name>
                     <description>BODVDD Synchronization Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCORERDY</name>
                     <description>BODCORE Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCOREDET</name>
                     <description>BODCORE Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCORESRDY</name>
                     <description>BODCORE Synchronization Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BODVDDRDY</name>
                     <description>BODVDD Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODVDDDET</name>
                     <description>BODVDD Detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BVDDSRDY</name>
                     <description>BODVDD Synchronization Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCORERDY</name>
                     <description>BODCORE Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BODCOREDET</name>
                     <description>BODCORE Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCORESRDY</name>
                     <description>BODCORE Synchronization Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BODVDD</name>
               <description>BODVDD Control</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Hysteresis Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACTION</name>
                     <description>Action when Threshold Crossed</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACTIONSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>The BODVDD generates a reset</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT</name>
                           <description>The BODVDD generates an interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STDBYCFG</name>
                     <description>Configuration in Standby mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run during Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACTCFG</name>
                     <description>Configuration in Active mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PSEL</name>
                     <description>Prescaler Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PSELSelect</name>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide clock by 2</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide clock by 4</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide clock by 8</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide clock by 16</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide clock by 32</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide clock by 64</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide clock by 128</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Divide clock by 256</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV512</name>
                           <description>Divide clock by 512</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV1024</name>
                           <description>Divide clock by 1024</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2048</name>
                           <description>Divide clock by 2048</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4096</name>
                           <description>Divide clock by 4096</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8192</name>
                           <description>Divide clock by 8192</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16384</name>
                           <description>Divide clock by 16384</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32768</name>
                           <description>Divide clock by 32768</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV65536</name>
                           <description>Divide clock by 65536</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL</name>
                     <description>Threshold Level for VDD</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
